## Terraform Lint/Plan Results
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
b2_bucket.db-backups: Refreshing state... [id=531125b9d9ad0bd484480d18]
b2_bucket.tmeit-se-2011-dump: Refreshing state... [id=0351c5e9b99d1b0484480d18]
hcloud_firewall.myfirewall: Refreshing state... [id=572118]
b2_bucket.terraform-state: Refreshing state... [id=c33185c9297d9b5484380d18]
tls_private_key.terraform_access: Refreshing state... [id=2ffac8d1a1e85232461425b441d27bce00a220c3]
data.cloudflare_api_token_permission_groups.all: Reading...
cloudflare_record.mx-2: Refreshing state... [id=f5173544ebe28b799c113daf0df3e0e5]
cloudflare_record.mx-1: Refreshing state... [id=05ee2ea4ce180da1b784dfd3ade993c3]
cloudflare_zone_settings_override.tmeit-se-settings: Refreshing state... [id=6a806c0199e15cdf23bb3017a90bf149]
data.cloudflare_api_token_permission_groups.all: Read complete after 0s [id=37f58c2e50041f9eed30c0006b111b44]
b2_application_key.database-backup: Refreshing state... [id=00331599db448d80000000004]
hcloud_server.node1: Refreshing state... [id=25047988]
cloudflare_api_token.dns_validation_token: Refreshing state... [id=c8a740fd710299e7612975c93125667d]
cloudflare_record.www-aaaa: Refreshing state... [id=9f7b0d63a18b5513abb8db23ce62cd46]
null_resource.run-ssh-install: Refreshing state... [id=5577006791947779410]
hcloud_rdns.node1_ipv6: Refreshing state... [id=s-25047988-2a01:4f9:c012:6063::1]
hcloud_rdns.node1_ipv4: Refreshing state... [id=s-25047988-65.21.188.62]
cloudflare_record.root-aaaa: Refreshing state... [id=d357e52c5cacabec46933fa577fb0e88]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # b2_bucket.db-backups will be updated in-place
  ~ resource "b2_bucket" "db-backups" {
        id          = "531125b9d9ad0bd484480d18"
        # (7 unchanged attributes hidden)

      ~ lifecycle_rules {
          ~ days_from_hiding_to_deleting  = 365 -> 14
          ~ file_name_prefix              = "tmeit-db-backup-daily" -> "tmeit-db-backup-hourly"
            # (1 unchanged attribute hidden)
        }
      ~ lifecycle_rules {
          ~ days_from_hiding_to_deleting  = 14 -> 365
          ~ file_name_prefix              = "tmeit-db-backup-hourly" -> "tmeit-db-backup-daily"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # cloudflare_record.mx-1 will be updated in-place
  ~ resource "cloudflare_record" "mx-1" {
        id              = "05ee2ea4ce180da1b784dfd3ade993c3"
        name            = "@"
      ~ value           = "mailcluster.loopia.se" -> "node1.tmeit.se."
        # (11 unchanged attributes hidden)
    }

  # cloudflare_record.mx-2 will be destroyed
  # (because cloudflare_record.mx-2 is not in configuration)
  - resource "cloudflare_record" "mx-2" {
      - allow_overwrite = false -> null
      - created_on      = "2022-10-26T21:38:35.49535Z" -> null
      - hostname        = "tmeit.se" -> null
      - id              = "f5173544ebe28b799c113daf0df3e0e5" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2022-10-26T21:38:35.49535Z" -> null
      - name            = "@" -> null
      - priority        = 20 -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - ttl             = 1 -> null
      - type            = "MX" -> null
      - value           = "mail2.loopia.se" -> null
      - zone_id         = "6a806c0199e15cdf23bb3017a90bf149" -> null
    }

  # cloudflare_record.node1-a will be created
  + resource "cloudflare_record" "node1-a" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "node1"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "65.21.188.62"
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.node1-aaaa will be created
  + resource "cloudflare_record" "node1-aaaa" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "node1"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = "2a01:4f9:c012:6063::1"
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.spf will be created
  + resource "cloudflare_record" "spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "v=spf1 +mx ~all"
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # null_resource.run-ssh-install must be replaced
-/+ resource "null_resource" "run-ssh-install" {
      ~ id       = "5577006791947779410" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2022-11-01T17:02:32Z" -> (known after apply)
        }
    }

  # tls_private_key.dkim-ed25519 will be created
  + resource "tls_private_key" "dkim-ed25519" {
      + algorithm                     = "ED25519"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # tls_private_key.dkim-rsa will be created
  + resource "tls_private_key" "dkim-rsa" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 6 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @JustinLex, Action: `pull_request`*